cases/ansys_verification/VMFL004/case/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType  laminar;   // manual p.21: "The flow is steady and laminar."
