cases/ansys_verification/VMFL004/case/system/blockMeshDict.template
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// VMFL004 manual p.21: length 1.5 m (x), gap 1 m (y).  z is the empty direction,
// thickness 0.1 m.  Cyclic in x (the manual's "periodic boundaries").
scale 1;
vertices
(
    (0   0 0) (1.5 0 0) (1.5 1 0) (0 1 0)
    (0   0 0.1) (1.5 0 0.1) (1.5 1 0.1) (0 1 0.1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (__NX__ __NY__ 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    left   { type cyclic; neighbourPatch right; faces ((0 4 7 3)); }
    right  { type cyclic; neighbourPatch left;  faces ((1 2 6 5)); }
    movingWall { type wall; faces ((3 7 6 2)); }   // y = 1 m, U = 3 m/s in +x
    fixedWall  { type wall; faces ((0 1 5 4)); }   // y = 0
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
